import { BackBtnContainer } from "~/widgets";

export default function PrivacyPolicy() {
  return (
    <div className="privacy-policy">
      <BackBtnContainer />
      <h3>Политика конфиденциальности</h3>
      <p>
        <span className="text-transform-none">Сайт “IDEAS”</span> (далее "сайт")
        разработано с учетом строгих норм конфиденциальности и безопасности
        данных пользователей. Мы ценим ваше доверие и обязуемся обеспечивать
        защиту ваших личных данных. Настоящая Политика конфиденциальности
        объясняет, как мы собираем, используем и защищаем информацию, которую вы
        предоставляете при использовании нашего приложения. <br />
        <span className="bold">1. Собираемая информация</span> <br />
        При использовании САЙТА мы можем собирать следующие виды информации:{" "}
        <br />• <span className="text-transform-none">
          Личная информация:
        </span>{" "}
        Мы можем собирать персональные данные, такие как ваше имя, адрес
        электронной почты и номер телефона, при регистрации НА САЙТЕ или при
        необходимости для его использования. <br />
        <span className="text-transform-none">
          • Техническая информация:
        </span>{" "}
        Мы можем собирать информацию о вашем устройстве, такую как уникальные
        идентификаторы устройства, версия операционной системы, информация о
        сети и другие технические данные, необходимые для обеспечения
        работоспособности приложения. <br />
        <span className="text-transform-none">• Данные использования:</span> Мы
        можем собирать информацию о вашем взаимодействии с САЙТОМ, включая
        действия, совершаемые внутри САЙТА, и данные о продолжительности и
        частоте использования. <br />
        <span className="bold">2. Использование информации</span> <br />
        Собранная нами информация используется исключительно для целей
        обеспечения функционирования САЙТА и улучшения его качества. <br />
        Мы можем использовать вашу персональную информацию для следующих целей:
        <br />
        • Предоставление доступа к функциям САЙТА и выполнение ваших запросов.
        <br />
        • Улучшение работы и обновление САЙТА для повышения удобства пользования
        и безопасности. <br />
        • Обеспечение безопасности и защиты правилами и политиками. <br />
        • Предоставление персонализированных услуг и рекомендаций. <br />
        <span className="bold">3. Разглашение информации</span> <br />
        Мы строго соблюдаем принципы конфиденциальности и не передаем вашу
        личную информацию третьим лицам без вашего согласия, за исключением
        случаев, предусмотренных законодательством. <br />
        <span className="bold">4. Безопасность данных</span>
        <br />
        Мы принимаем меры по обеспечению безопасности ваших данных, в том числе
        шифрование информации и регулярное обновление мер защиты. Однако следует
        помнить, что ни один метод передачи данных через интернет или хранения
        данных не является абсолютно безопасным.
        <br />
        <span className="bold">5. Ваше согласие</span>
        <br />
        Используя наш САЙТ, вы соглашаетесь с условиями нашей Политики
        конфиденциальности. Если вы не согласны с этими условиями, пожалуйста,
        прекратите использование САЙТА. <br />
        <span className="bold">6. Изменения в политике</span> <br />
        Мы оставляем за собой право периодически вносить изменения в нашу
        Политику конфиденциальности. Любые изменения будут опубликованы здесь,
        поэтому рекомендуем периодически проверять эту страницу на обновления.
        <br />
        <br />
        <span className="text-transform-none">
          Последнее обновление: [05.06]
        </span>
      </p>
    </div>
  );
}
